mach-3-tunnel-with-step/sonicFoam30/system/blockMeshDict
FoamFile 
{
	version  2.0;
	format   ascii;
	class    dictionary;
	object   blockMeshDict;
}

//L_1 = 6.000000e-01	L_2 = 2.400000e+00	H_1 = 2.000000e-01	H_2 = 8.000000e-01

//cells (10 10 10)

//grading (1 1 1)

convertToMeters 1.0;

vertices
(
	(0.000000 0.000000 -0.050000)	//0
	(0.600000 0.000000 -0.050000)	//1
	(0.000000 0.200000 -0.050000)	//2
	(0.600000 0.200000 -0.050000)	//3
	(3.000000 0.200000 -0.050000)	//4
	(0.000000 1.000000 -0.050000)	//5
	(0.600000 1.000000 -0.050000)	//6
	(3.000000 1.000000 -0.050000)	//7
	(0.000000 0.000000 0.050000)	//8
	(0.600000 0.000000 0.050000)	//9
	(0.000000 0.200000 0.050000)	//10
	(0.600000 0.200000 0.050000)	//11
	(3.000000 0.200000 0.050000)	//12
	(0.000000 1.000000 0.050000)	//13
	(0.600000 1.000000 0.050000)	//14
	(3.000000 1.000000 0.050000)	//15
);

blocks
(
	hex (0 1 3 2 8 9 11 10)	(10 10 10)	simpleGrading (1 1 1)	//block 0
	hex (2 3 6 5 10 11 14 13)	(10 10 10)	simpleGrading (1 1 1)	//block 1
	hex (3 4 7 6 11 12 15 14)	(10 10 10)	simpleGrading (1 1 1)	//block 2
);

boundary
(
	inlet
	{
	type patch;
	faces
	(
